{
    "#personni-moveis-p1": "This was my final university project. The main idea was to create a web based platform for furniture e-commerces that would offer a new and dynamic manner of selling. The solution is aimed at medium and small enterprises wich don't have a well established e-commerce, but could be adopted by any kind of furniture related business. The objective was reached and some new features for customization were added.",
    "#personni-moveis-p2": "The main focus of the project, offering a different sale strategy integrated in the e-commerce, gives site admins or business managers the tools to specify models for a kind of furniture, having all characteristics that the customer could desire, such as exchanging for a different part of a furniture, different materials, composition, and other characteristics, everything can be handled by administrators, as much for the limits present in the furniture, giving the hability to maintain the limits and production capacity of the store's factory. After administrators specify the furniture model and options, the store clients are able to follow a modeling journey, through iterative steps, selecting the disired characteristics off a chair, for example, the client can see the value of the product modeled, if conforming to it's expectations, the client would next purchase of the product.",
    "#personni-moveis-p3": "Besides this different buying journey, standard selleing characteristics existing in e-commerces were added, such as the sale of standart non customizable produtos and personalized furniture, wich enolve making few customizations in a fixed, standard furniture piece. Additional features added where:",
    "#personni-feature-1": "Store and page customization - admins can change color, template images and styles through admin interface",
    "#personni-feature-2": "Use of brazilian payment API <a class='main-link' href='https://sejaefi.com.br/central-de-ajuda/api/oferecer-pagamento-online-em-site#conteudo'>(Gerencianet);</a>",
    "#personni-feature-3": "Support for different access profiles:",
    "#personni-role-1": "Admin - everything authorized;",
    "#personni-role-2": "Colaborator - limited authorization;",
    "#personni-role-3": "User - Authorized to see own info, buy products, etc...",
    "#personni-moveis-p4": "Due to an agreement with the 5 members of this project, only the API code is now open-software, while the front-end is kept in a private repository. Sensitive data such as API access tokens, hints and internal comments where removed from versioning history before making the API repository public.",
    "#personni-back-tech-3": "Java mail sender with gmail;",
    "#personni-back-tech-4": "JWT validation for access and privileges (with spring security);",
    "#personni-back-tech-6": "Address API for Brazilian CEP (zip code);",
    "#personni-front-tech-3": "Google-maps API for store localization;"
}